import React from "react";
import { useState, useEffect } from "react";
import style from "./Solar.module.css";
import Planet from "./modules/Planet";
import Button from "./modules/Button";
import Information from "./modules/Information";
import Info from "./modules/Info";

const Solar = () => {
  const data = [
    {
      id: 1,
      namePlanet: "Mercury",
      classWrapper: "mercury",
      classPlanet: "mercuryPlanet",
      srcImage: "/images/mercury.png",
      info: 170503,
      information: [
        {
          title: "اندازه و فاصله عطارد تا خورشید چه قدر است؟",
          text: `سیارهٔ عطارد با فاصلهٔ ۵۷ میلیون و ۹۲۴ هزار کیلومتری از خورشید،
        نزدیک‌ترین سیارهٔ سامانهٔ خورشیدی به خورشید است و کم‌ترین مسافتی که با
        زمین پیدا می‌کند، به ۸۰ میلیون کیلومتر می‌رسد. به خاطر نزدیکی این سیاره
        به خورشید در طرف رو به خورشید آن دما به ۴۶۵ درجهٔ سانتی‌گراد و به علت
        حرکتی وضعی آرام آن در طرف شب دما به ۱۴۸- درجهٔ سانتی‌گراد می‌رسد. گردش
        وضعی این سیاره، حدود دو ماه طول می‌کشد و از این رو، گرم شدن آن در روز و
        سرد شدنش در شب دیرپاست و همین باعث فرسایش خاک عطارد می‌شود.`,
        },
        {
          title: `عارضه های سطحی`,
          text: `دانشمندان هنوز نمی‌دانند که فعالیت‌های آتشفشانی این سیاره سنگی، چقدر به
        طول انجامیده. سن دشت‌های گدازه‌ای‌اش را می‌توان به عصر «بمباران سهمگین
        متأخر»، یا حدود ۴ میلیارد سال پیش نسبت داد؛ که در جریانش اعضای منظومه
        شمسی، آماج برخورد شهابسنگ‌های غول‌آسا واقع می‌شدند. به محض کاهش آمار این
        برخوردها بود که گدازه در سرتاسر عطارد جریان یافت و با پر کردن گودال‌ها،
        عوارض نرم و مسطحی را به وجود آورد. فرو زمین‌ها هم در همین گودال‌ها به
        وجود آمدند و در واقع تنها نقاطی به‌شمار می‌رفتند که بستر سنگیِ سیاره در
        آن‌ها «منبسط» (و نه منقبض) می‌شد.`,
        },
      ],
    },
    {
      id: 2,
      namePlanet: "Venus",
      classWrapper: "venus",
      classPlanet: "venusPlanet",
      srcImage: "/images/venus.png",
      info: 126074,
      information: [
        {
          title: `    سیاره زهره چیست؟`,
          text: `       سیاره زهره، ونوس یا ناهید دومین سیاره از خورشید و نزدیکترین همسایه
        سیاره‌ای ما است. سیاره زهره از نظر ساختار و اندازه مشابه زمین است و در
        جهت مخالف بیشتر سیارات به آرامی می‌چرخد. جو غلیظ آن گرما را در نتیجه
        اثرات گلخانه‌ای به دام می‌اندازد و آن را به گرمترین سیاره منظومه شمسی
        تبدیل می‌کند که دمای سطح آن به اندازه‌ای گرم است که می‌تواند سرب را ذوب
        کند. نگاهی اجمالی به منطقه‌ای پایین‌تر از ابرها، آتشفشان‌ها و کوه‌های
        تغییر شکل یافته را نشان می‌دهد.`,
        },
        {
          title: `اندازه و فاصله سیاره زهره چه قدر است؟`,
          text: `        با شعاع 6,052 کیلومتر (3760 مایل) سیاره ونوس یا ناهید تقریباً هم اندازه
        زمین است و شاید بتوان گفت کمی از زمین کوچکتر است. از فاصله متوسط 108
        میلیون کیلومتر (67 میلیون مایل)، سیاره ونوس 0٫7 واحد نجومی با خورشید
        فاصله دارد. یک واحد نجومی که مخفف آن AU است، فاصله خورشید تا زمین است.
        رسیدن نور از خورشید تا زهره حدود 6 دقیقه طول می‌کشد.`,
        },
        {
          title: `      مدار و چرخش سیاره زهره چگونه است؟`,
          text: `        چرخش و مدار سیاره ونوس از چند جهت غیرمعمول است. زهره یکی از دو سیاره‌ای
        است که از شرق به غرب می‌چرخد. فقط سیاره زهره و اورانوس این چرخش رو به
        عقب را دارند. ونوس یک چرخش را در 243 روز زمینی کامل می‌کند که این موضوع
        سبب می‌شود تا طولانی‌ترین روز را نسبت به هر سیاره دیگری در منظومه شمسی
        داشته باشد، این مقدار حتی طولانی‌تر از یک سال کامل در این سیاره است. اما
        در این سیاره بر خلاف بسیاری دیگر از سیارات منظومه شمسی، خورشید هر روز
        طلوع و غروب نمی‌کند. در ونوس، یک چرخه روز-شب 117 روز زمینی طول می‌کشد
        زیرا ونوس در خلاف جهت چرخش مداری خود به دور خورشید می‌چرخد. زهره در 225
        روز زمینی یا کمی کمتر از دو روز ونوسی یک دور کامل را به دور خورشید (یک
        سال به وقت ونوس) انجام می‌دهد. در حقیقت هر سال در ونوس برابر با ۲ روز
        ونوسی است. مدار آن به دور خورشید تقریباً یک دایره کامل است و دایروی‌تر
        از هر مدار دیگری به دور خورشید است. مدارهای دیگر سیاره‌های منظومه شمسی
        حول منظومه شمسی بیشتر بیضوی یا بیضی شکل است.`,
        },
      ],
    },
    {
      id: 3,
      namePlanet: "Earth",
      classWrapper: "earth",
      classPlanet: "earthPlanet",
      srcImage: "/images/earth2.png",
      info: 107218,
      information: [
        {
          title: `اندازه و فاصله زمین تا خورشید چه قدر است؟`,
          text: `      زمین با شعاع 6٬371 کیلومتر (3،959 مایل) بزرگترین سیاره زمینی و پنجمین
          سیاره بزرگ منظومه شمسی است.
                    با در نظر گرفتن فاصله متوسط 150 میلیون کیلومتر (​​93 میلیون مایل) زمین
          دقیقاً یک واحد نجومی با خورشید فاصله دارد زیرا یک واحد نجومی که مخفف
          آن AU است، فاصله خورشید تا سیاره زمین است. این واحد راهی آسان برای
          مقایسه سریع فاصله سیارات از خورشید را فراهم می‌کند. همچنین حدود هشت
          دقیقه طول می‌کشد تا نور خورشید به سیاره ما یعنی زمین برسد.`,
        },
        {
          title: `محیط و مساحت زمین چه قدر است؟`,
          text: `          همان طور که گفتیم زمین شعاعی برابر با 6٬371 کیلومتر (3،959 مایل) دارد.
          با استفاده از رابطه مساحت کره و محیط دایره، زمین مساحتی برابر با ۵۱۰٫۱
          کیلومتر مربع و محیطی برابر با ۴۰٬۰۰۷ کیلومتر دارد. در این بیان محیط
          کره زمین را حول قطب‌های آن در نظر گرفته‌ایم. اگر محیط دایره حول خط
          استوا را در نظر بگیریم این مقدار برابر با ۴۰٬۰۷۵ کیلومتر است.`,
        },
      ],
    },
    {
      id: 4,
      namePlanet: "Mars",
      classWrapper: "mars",
      classPlanet: "marsPlanet",
      srcImage: "/images/mars.png",
      info: 86677,
      information: [
        {
          title: `   چرا مریخ را سیاره سرخ می نامند؟`,
          text: `          رنگ مسی روشن مریخ به دلیل فراوانی مواد معدنی غنی از آهن در رگولیت‌های
          آن است. رگولیت به سنگ‌ها وغبارهای سستی گفته می‌شود که سطح را
          می‌پوشانند. خاک زمین هم نوعی رگولیت است با این تفاوت که سرشار از مواد
          آلی است. به نقل از ناسا، مواد معدنی آهنی دچار اکسایش یا زنگ‌زدگی
          می‌شوند و ظاهر سرخ‌رنگی را به مریخ می‌بخشند.`,
        },
        {
          title: `سیاره مریخ چگونه تشکیل شد؟`,
          text: `          قریباً ۴٫۶ میلیارد سال پیش در اولین روزهای منظومه شمسی، قرصی از گاز و
          غبار در مدار خورشید جوان شکل گرفت. دو نظریه نشان می‌دهند که چگونه در
          طی میلیون‌ها سال، سیاره‌های سنگی داخلی منظومه شمسی از داخل این قرص
          ماده شکل گرفتند. براساس نظریه‌ای قدیمی‌تر، غبار موجود در منظومه شمسی
          داخلی به شکل توده‌های بزرگ‌تری درآمد و این توده‌ها به تدریج هم‌اندازه
          با ماه زمین شدند. برخورد این جنین‌های سیاره‌ای درنهایت به شکل‌گیری
          سیاره‌هایی مثل عطارد، زهره، زمین و مریخ انجامید.`,
        },
      ],
    },
  ];
  const [numberPlanet, setNumberPlanet] = useState(
    () => JSON.parse(localStorage.getItem("NUMBER")) || 1
  );
  useEffect(() => {
    localStorage.setItem("NUMBER", JSON.stringify(numberPlanet));
  }, [numberPlanet]);
  return (
    <div className={style.wrapper}>
      {data.map((planet) => (
        <Info key={planet.id} planet={planet} numberPlanet={numberPlanet} />
      ))}
      {/* Solar System */}
      <div className={style.solar}>
        <div className={style.sun}></div>
        <div className={style.test}>
          {data.map((planet) => (
            <Planet
              key={planet.id}
              planetStyles={style}
              planet={planet}
              numberPlanet={numberPlanet}
            />
          ))}
        </div>
      </div>
      {/* Buttons */}
      <ul className={style.list}>
        {data.map((planet) => (
          <li key={planet.id}>
            <Button
              planet={planet}
              setNumberPlanet={setNumberPlanet}
              planetStyles={style}
            />
          </li>
        ))}
      </ul>
      {/* Data Information */}
      <ul>
        {data.map((planet) => (
          <li key={planet.id}>
            {planet.id === numberPlanet ? (
              <Information planet={planet} setNumberPlanet={setNumberPlanet} />
            ) : null}
          </li>
        ))}
      </ul>
    </div>
  );
};

export default Solar;
